Revit 2026 API

# PipeIsPipingConnector Method

---

Checks if the given connector is a valid piping connector.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsPipingConnector(
	Connector connector
)
```
```vb
Public Shared Function IsPipingConnector (
	connector As Connector
) As Boolean
```
```cpp
public:
static bool IsPipingConnector(
	Connector^ connector
)
```
```fsharp
static member IsPipingConnector :
        connector : Connector -> bool
```

#### Parameters

connector Connector
     Connector to check

#### Return Value

Boolean True if the connector has the Piping domain type.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A connector must be Piping domain type to be connected with other pipes.

#### Reference

Pipe Class

Autodesk.Revit.DB.Plumbing Namespace